{
  "reviews": [
    "Great place overall!  Great atmosphere!  Great food!   Reservations are iffy.  Parking is iffy.  Make if you use the pay lot you pay for EXTRA TIME BC YOU WILL GET TOWED and fast!  \n\nAnyway, I highly recommend you celebrate Chinese new year here with their special menu.   Yum yum",
    "If I were to rate this restaurant on decor alone, it would get 5 plus stars.  Entering the dining room I felt transported to a lovely garden tea room in Sichuan province.  Even the dishware and chopsticks were gorgeous!  The fork was gold. \n\nWe started our meal with Hot and Sour Soup.  It was delicious!  The thought entered my mind that when I got home I would write an extremely positive review of Szechuan Opera.  Instead it is a negative review I sit here writing.  After the soup, everything went downhill.\n\nMy husband's Pork Egg Roll was smaller than those we've had elsewhere and not very flavorful.  My Spring Rolls were overdone and greasy.\n\nShrimp with Garlic Sauce was my main dish.  There were at most only 10 flavorless, thumbnail size shrimp in the dish with a few slices of equally flavorless celery, green pepper and mushrooms.  The sauce was lukewarm, had no garlic flavor to it and was too thick, too sweet and too red in color.  The accompanying Fried Rice, also only lukewarm, was bland. \n\nHubby's General Tso's Chicken was also a huge disappointment.  Again, the sauce was too sweet,  too thick and so red we thought they might have had an accident and spilled a whole bottle of red food color into it.  At least it was hot.\n\nAnd at the end, we didn't even get fortune cookies.\n\nThumbs down for Szechuan Opera.",
    "We reserve this place for when I'm craving a complex, spicy beef broth. This time we took our family here and they really loved the authentic Chinese dishes. \nSzechuan pepper is known for its citrus-like flavor with a tingling, numbing sensation. And it doesn't really hit your tastebuds with hot spice, either, which I think is great because I feel like I can taste the flavors in the food better.\nSome of the dishes I recommend: Schezuan beef soup and the clay pot. The beef is amazingly tender and full of flavor. In the beef soup, I only wish there was more beef chunks. The clay pot, however, did have a generous amount of beef. Either way, it was very tasty. The soup is something I almost always order. It definitely hits the spot when you're recovering from a cold. \nService is good, not overly friendly servers, but they get the job done and always on point.\nThe outside of the building is very plain, and unsuspecting. Walk inside and you'll be transported to a luxurious dining area with comfortable booths and a nice ambiance to match the quality of the food.",
    "I went for lunch. The place has an unassuming facade, yet inside it has a very pleasant decor and a Golden Throne, worthy of an Emperor/Empress.\nI chose the special lunch L16- Shredded Pork w/ Peppers & Spring Roll, Rice; Shu Mai Dumplings; Jasmine Tea Bubble.\nThe pork dish was very tasty. I devoured it pretty quickly. \nThe Spring Roll (vegetable) crispy came w/ a sweet & sour sauce. Good\nThe dumplings came last; 4 small shrimp dumplings. They were full of shrimp, w/a dipping Soy Sauce.\nThe Jasmine Milk Tea needed more ice, refreshing. I took it home and placed it in the freezer for 1/2 hours. Perfect.\nService was attentive.\nI will be back.",
    "Enjoyed my first experience at Szechuan celebrating the lunar new year with some fellow yelpers. Huge shout out to Jenny R for planning everything!! \nWe sat in a super cute booth that fit us six perfectly, so private and cozy.\nThey offered a special menu, we ordered six items from that and a few regular items.\nSpecial menu:\nStir fried twin lobster with ginger and scallions \nOil and shallot steamed abalone \nDungeness crab in Szechuan style\nSteamed sea bass\nBraised sea cucumber with scallions \nSteamed garlic shrimp w vermicelli \n\nReg menu:\nWontons in spicy chili sauce\nDuck with veggies \nDried sautéed string beans\n\nWe shared all plates, family style\nTried some new items I would normally not order, the duck and wontons were ridiculously amazing! \nWe all ate like queens and I had the best time with these girls!",
    "Thanks to Jenny R for putting together a little Chinese New Year celebration for us. I haven't been here before.\n\nApparently they do not take reservations even for a larger group. Also, note that the parking lot adjacent is 2 hours of free parking with validation. If you use street parking, pay attention to the signs.\n\nThere were 6 of us and we were sat in a comfortable booth.\n\nOverall, service was friendly and efficient.\n\nWe opted to share several plates family style, mostly off the special New Year Menu,\n\nThe food was flavorful. No complaints at all.\nI'd return here in the future!",
    "I have been meaning to try Szechuan Opera for so long after hearing so many great things, and I finally visited with friends for dinner. We went on Friday at 630 and it was not busy, we were seated right away.\n\nThe service was very friendly and the right amount of attentive. The food came out at a good pace (appetizers followed by our entrees). \n\nAs has been previously stated, the decor is absolutely gorgeous. \n\nThe food for me was hit or miss. I got the tomato egg entree and it was very salty. I love tomato egg and this had slices of tomato that weren't cooked down the way I am used to having the dish. It might just be a different style of cooking it that I'm not used to, but it didn't have as much flavor as I was hoping (just tasted salty).\n\nThe scallion pancake was also a miss. It was too dry and I couldn't taste the scallion, just the dough.\n\nThe peking duck buns were yummy and the bao bun very soft. I also enjoyed the garlic cucumber -- one of my absolute favorite appetizers in Chinese cuisine, and this one didn't disappoint. The cucumber was nice and crispy and it had a ton of garlic flavor.\n\nAlthough I didn't love my entree, I would definitely come back to try other dishes.",
    "Very artistic interior design \nAlways delicious food and drinks\nPolite and kind waiters\nDefinitely GO",
    "I managed to get tickets to Jon Batiste (thanks Dad!!) back-to-back in Toronto and Montreal on a Tuesday and Wednesday and I planned a roadtrip from home in Central Vermont out to Niagara Falls and then Toronto, Montreal and back down to Hartland. My plan was to leave directly from work on the Monday at like 3pm and drive to Niagara Falls. I figured that was about as far as I could make it that first night. In hindsight I think I probably could have made it to Toronto that night. But I guess, better safe than sorry. I was making such good time across the NYS Thruway that I decided to find a spot opened late to get something to eat (I had snacked my way across New York...). \n\nRochester was the only place with anything open late and really wasn't a detour of any consequence. I had no idea there was LEGIT Szechuan food in Rochester?? I mean, I guess, how would I know? It's been a few decades since I lived in Upstate NY. \n\nSzechuan Opera was open until 10pm and I pulled in shortly after 9. The menu is huge. Excellent variety of all sorts of things, including Dim Sum. My problem was I didn't have a plan. I hate not having a plan when I'm going to a restaurant. I'm THAT person! I read menus and choose items ahead of time. Which probably seems ridiculous. I own a restaurant and I have a somewhat absurdly large menu at my own place. Yet I am one of those people that just does not like to go into a new spot \"cold.\" I always feel like I maximize my dining experience if I review the menu before. \n\nMy other \"issue\" is that I don't really ever want to try one thing. I want to try as many things as possible and that does require a plan of attack!\n\nService was really good and everyone was very friendly. Although they don't allow anyone to sit/eat at the bar? So I had to sit a table by myself. I am just not a fan of that. But, last minute dining choices late at night...\n\nGot my water, got tea, got truly horrible sake. HAHAHAHA That was my fault. They've just got one terrible sake they serve hot (NEVER drink hot sake my friends).\n\nIt was a little tricky to find menu items that did not have beef, pork or poultry (which I don't eat). I decided to focus on appetizers and Dim Sum so I could try a few, different things. Because I just couldn't convince myself to commit to one or even two items! LOL\n\nFYI: All portions at Szechuan Opera are huge. Regardless of whether they're called \"appetizers\" or something else. I wound up with a ridiculous amount of food! \n\nWhat I Ordered:\n\nChengdu Style Mung Bean Noodle: Look, when the waiter tells you it's spicy and you're in a Szechuan restaurant. Believe them. Delicious, but your taste buds might need some time to recover...\n\nWood Ear Mushroom with Garlic: OMG!!! First these Mushrooms were the biggest I'd ever seen. I could eat this dish all day. It was so insanely delicious. Wow. \n\nCrispy Cucumber with Garlic: gorgeous, beautiful fresh, delicious.\n\nCrispy Shrimp with Tofu Roll Dim Sum: I think this might be the best fried food item I've ever eaten. Hot and crispy right from the oil. Paper thin tofu wrapper. Everything about this was perfection.\n\nPan Fried Chives and Shrimp Dumpling: Also wonderful and delicious.\n\nBlack Truffle and Mixed Mushroom Dumpling: Skip these. Meh. Not so tasty and I didn't love the wet, gummy consistency. \n\nIMO I ate an impressive amount of what I ordered. Because some of these were just so good I didn't want to stop. HIGHLY RECOMMEND. Don't get the sake.",
    "I recently stumbled upon Szechuan Opera, and what a delightful surprise it was! Nestled just outside of Rochester, NY, this authentic Chinese restaurant truly lives up to its reputation for bold, fiery flavors.\n\nIf you're a spice enthusiast like me, you're in for a treat. When they say \"spicy,\" they mean it - the heat here is not for the faint of heart. I ordered the Mala Dry Pot and the Spicy Chicken, and both dishes packed a serious punch. The numbing sensation from the Szechuan peppercorns in the Mala Dry Pot was an experience in itself, and the Spicy Chicken was perfectly tender with a fiery kick.\n\nThe one thing to note is that their dishes do tend to lean on the saltier side, which complements the spice nicely but might not be for everyone. However, if you're a fan of bold, savory flavors, this place will be right up your alley.",
    "We've come here so many times and the one dish we always order is the Q16. Mixed Vegetable Tofu in Claypot. It comes out sizzling hot and the tofu is so tender. All the vegetables that the tofu is paired with just completes the dish. The other dish I also really like is J2. Garlic Sauce Style Pork. The first time I tried it, we got it as it was intended to be made - spicy. It ended up being too spicy for me since I don't typically eat spicy foods. So the second time I ordered it, we requested no spice and it tasted just as good. I love the sour taste of it and the pork is so tender. It comes with thinly sliced bamboo shoots which are so yummy. Service is extremely quick and the food always arrives in 10 minutes. The interior is super aesthetic with the lantern lights above us and maple and cherry blossom trees.",
    "Got takeout here for the first time - the usual dishes like lo mein and sesame chicken and dim sum. Everything was so great. I think some of my favorite lo mein in the area. The spicy wontons were elite! I'll be going back for sure.",
    "So many options that I havent seen before at szechuan places including getting the 'normal' spicy treatment on tofu! Finally! I can have something like the chicken my partner stop talking about! We ordered a lot of food but everything was gone at the end because it was all so good. They have special rooms for large groups which was nice. Service was great and accommodating for restrictions.",
    "Went here for take out and was greeted and helped by very friendly staff. It looks like a random restaurant however, it is very beautifully decorated. Love seeing the green plants and many many well cared for plants.\n\nFood was prepared fresh and hot even after driving back to hotel. Very delicious and authentic. Good portion and got a very relaxing take out dinner in my room watching NBA.\n\n水煮魚 and 楊州炒飯\n\nHighly recommend!",
    "It seems that their original chef may have left; we ordered five dishes, and all were disappointing. The portions were smaller, and the quality and taste had declined. For instance, in the \"suan ni bai rou\" dish, they added lots of cucumbers but only five pieces of meat. Moreover, the man at the front made my family wait over 20 minutes and allowed others without reservations to be seated before us. He also refused to let us sit at a larger table reserved for five, even though there were only four place settings visible. Yet, another group of three adults and one child were seated at a similar table in the back of the hall. I'm unsure why we were treated differently--was it because we are Chinese or because we spoke Mandarin? I will not be returning to this restaurant, and I will definitely inform my friends about our experience.",
    "Overall was pretty good.  Enjoyed the steamed pork dumplings the most.  The beef dry pot was decent, and chicken in garlic sauce was a little better in my opinion.  Good service.  The space itself was very nice, well decorated and ample space.",
    "very delicious food, quick and fast service. my friends who attend school here love this place. ordered three dishes to share and each come with one bowl of rice. they have another location in bing called red chili i believe. the interior has a lot of traditional chinese touches added to it. would be good for large groups!",
    "Cozy and comfortable, Szechuan Opera has gone to alot of effort and cost to create a unique, cozy dining space. When I first tried them years ago I found the food to be just adequate, but recent visits have convinced me that they have become one of the best Chinese restaurants in the Rochester area (which sadly can't compete with NYC or Toronto), even as others have lost their edge. Because of the variety of styles represented on the menu, this is a restaurant where making the right choice for you is important. Some dishes have heat and Szechuan pepper enough to set the tastebuds tingling, but can be overwhelming to the palate. This isn't the place to go all-in on a single dish. I suggest exploring and sampling and sharing many dishes from the menu to discover those culinary gems that might become your new favorites.",
    "the food can be very good, but the way they do take out orders is terrible. They package each order in the kitchen then bring out a batch all at once of 6-7 orders. Consequently, I had a 40 minute wait and the food was cold.\nYou need to bring out each order one by one, not let them sit off to the side as you\ntake in multiple orders. I ordered first but I had to wait for all those  other orders as they came in. When it is ready, bring it out hot and fresh, don't make people wait 40 minutes for cold food. Otherwise, I would likely be returning",
    "This is a classic, Chinese restaurant you'd expect to find in any Chinatown neighborhood (though this is not located in one). Ornate and bold interior, including a golden throne for selfie time. Menu was extensive and traditional. Service very attentive. No draft beers, sadly, since some popular IPAs pair well with what's on the plate. Our table of five had different dishes, all were quite good and had a \"made at home\" appeal to them. Levels of spicyness are offered. Prices are fair and reasonable. Good family place, particularly for curious kids due to the decor.",
    "Some say, this is the best Chinese restaurant in Rochester. It's hard to argue with that opinion, as the dishes are wonderfully prepared and presented. They are particularly strong on appetizers and dim sum, but be sure not to miss the noodle dishes. It's easy to become a frequent visitor of the establishment.",
    "Delicious food, great service and superb ambience. I love this restaurant. Perfect portions, good prices and high quality food.",
    "Went on a Sunday afternoon, there were a few people dining and plenty of tables. The restaurant was unassuming in a plaza, but beautiful inside. Our server was attentive and the food came out quickly. \nOur food was delicious, fresh, and hot! Tons of options for authentic Szechuan Chinese and also \"American\" Chinese. \nThe egg rolls were crispy and delicious. The noodle dishes had the perfect amount of sauce and flavor. Everything was well seasoned.",
    "Fantastic food. Had take out. It  was fast and hot. Very nice delivery person. Highly recommend this restaurant. Please try this restaurant.",
    "Some of the best chinese food in Rochester! Tofu is always so crispy and fresh. The server we had last night was the best, made us a dessert even though the kitchen was closed. The hotpot rooms are nicely decorated and are great for parties. 10/10!",
    "Mediocre food and even worse service.  Server tried, but she was overwhelmed.  Wife's food came out cold, told the server, she said someone opened the back door in the kitchen which caused the food to be cold.  Huh??\nMy chicken was decent, very small portion.  Went once, got fooled by online reviews, never again.",
    "The best.  The dry pot is fabulous especially if you love spicy foods. The mushroom dumplings dim sum is so amazing that I could have a few orders of that in itself as a meal.",
    "Ambiance is excellent, service could improve, sat for a while before drinks was offered. Ordered steamed shu mai; steamed shrimp dumpling, beef spare ribs, steam buns, tripe dish, soy sauce chicken feet. Food tastes very bland. It took a while for the food to come, and it wasnt really busy. The food didnt justify the price they are charging for it.  Seek an alternative.",
    "I was very impressed! Around home it's hard to find good (or pretty much any) Chinese food, let alone dishes beyond Kung Pao Chicken.\n\nThis restaurant's menu is huge with probably about 100 different choices available.  Our group had \"regular\" (familiar) dishes and some of the szechuan ones I'd never heard of before.\n\nI can't remember the name of my favorite, except that it was one of the unfamiliar szechuan ones,chicken in a slightly sweet and pretty spicy sauce. Even the broccoli beef was wonderful with a range of spices and flavors above and beyond what I'm used to.\n\nThe peking duck buns were the only disappointment.\n\nThe restaurant is really fascinating inside -- don't let the drab strip-mall exterior fool you!\n\nWhen in Rochester again, I'll be back.  There are about 94 other dishes to try there.",
    "Szechuan Opera is right in my hood and is constantly tempting me with full color photos of their dim sum, filling the windows as you walk along their store front. \n\nThe hubs and I finally checked it out recently, in two back to back visits for said dim sum, and we really loved it.\n\nOn visit #1, we were there in the middle of the afternoon and the place was totally empty except for some staff in the back eating and a very busy woman on the phone taking take out orders. As soon as we got someone's attention we were seated and quickly ordered. We got 6 dishes: crabmeat and spinach dumplings, pan fried chive and shrimp dumplings, sea cucumber and mushroom dumplings, xiao long bao soup dumplings, pork sio pao (steamed buns), and crispy shrimp rolls. The food came out of the kitchen one plate at a time as it was ready, and we ate everything as it was fresh (and forgot to take any photos). We enjoyed everything and were really happy with food quality, portions and taste.\n\nOn visit #2 we were 'restaurant hopping' around Park Ave with another couple, and S.O. was stop #2. This time it was around 6pm and the place was packed with groups of what appeared to be students, all eating out of huge plates being served family style. We again ordered dim sum plus carafes of hot and cold sake. This time we ordered Peking duck steamed buns, pan fried chive and shrimp dumplings, xiao long bao soup dumplings, crispy shrimp rolls, black truffle mixed mushroom dumpling, and beef short ribs. Again, food was great, service was friendly and efficient (despite how busy the restaurant was) and we enjoyed the experience.\n\nCouple other notes I'll add: \n\nAlthough it seems like every restaurant in the area has increased prices due to inflation, I still feel that this place is a good value in that the size and number of pieces of dim sum per plate is generous and satisfying. \n\nThe internal decor invites large groups to come in for hot pot or to sit under (fake) trees and pagodas - we have yet to sit in one of the more festive settings, but always enjoy seeing them from adjacent tables! \n\nFinally, if you are driving in, there's free parking all around - front and back of the building lots and street.",
    "For my first in person experience it was a lil wierd. We had to ask for water, and for tea and for utensils and sharing plates. Then when we asked for some empty used dishes, beer bottle etc to be cleared the server went to clear the clean plates. About the plates, the only size is large serving ware or appetizer type plates, no regular dining sized for sharing.\n\nA total pet peeve of mine is seeing the staff eat. Both servers in the dining area were munching at different times throughout the evening. \n\nWarning the 2 pepper version of anything is really REALLY spicy. Like regular restaurants with one star or pepper spice indication I'm usually asking for 1-2 pepper upgrade. These chefs really mean their stars. One pepper really has heat and two well it has a lot more...like sweaty, nose drip, red eye more.\n\nThe dim sum was fantastic and the double (not twice...we were corrected) pork was good and the sizzling style fish. The dry pot was super spicy but gorgeously presented. The chicken and needle mushroom was very bland, I thought the bell pepper detracted from it and over powered the dish. I had hoped it would be a brown sauce, it's more like a thickened sauce from the moisture the chicken and mushroom gave off. \n\nA table mate shared the toilet is not attached to the wall and it's very dark in the ladies room.",
    "I haven't been here since the pandemic and I really missed it. The service is fast, the food comes from the kitchen with speed and the taste (and sometimes heat) is out of this world. We started with lettuce wraps, steamed dumplings and Sticky Rice for appetizers. The Sticky Rice was a real treat. They make it very well and it is not standard in many local Chinese restaurants. The Singapore Mein Fun had the familiar curry flavor and just enough spice to make it interesting. The Dry Fried Whole Fish (四川干烧鱼) was plentiful and perfectly presented. I was surprised by the spicy pork sauce but that is part of the name I forgot. It was excellent to share. They serve beer and wine. There is parking but the restaurant does not own the parking lot and the new owner is charging to park. [It is an unpleasant change for the folks who enjoyed free parking for years.] Nevertheless, we shall return to the Opera.",
    "The ambiance and service was great. The food variety was accommodating to diners who want to eat Sichuan and diners who want Americanized Chinese. We tried over 15 dishes family style and everything was delicious.",
    "4.5 stars. I have lived in big cities before so I would base this rating compared to other Rochester restaurants. Very unassuming place from the outside, but wow, the decor is beautiful in this restaurant, which really surprised me. Wooden tables, flowers, and a luxurious and clean feel. We came early on a weekend evening and were seated immediately. We tried a wood ear mushroom salad as well as a spicy dry pot. Both were solid options and a nice quick meal for us. The spicy dry pot had a lot of nice variety in regards to proteins and vegetables. Prices do run perhaps $1-2 higher than a little hole in the wall place, but given the cleanliness and how nice the area is (all of the restaurants along this street), very well justified.",
    "Honestly was not expecting to find delicious authentic Szechuan food during this trip to Rochester but glad I did. Can't want to come back!",
    "I ordered the beef dry hot pot. It was spicy and accompanied with peppers, mushrooms, onions and seasonings. It also came with your choice for fried or white rice. The service was quick. And the place is nicely decorated. I would recommend to try if in town.",
    "The food is great, service could be enhanced, difficult to order with the language barrier at times.\nThe prices keep creeping higher and higher.\n\nI have noticed that the portion is significantly smaller whenever I order take out which is frustrating.",
    "Ok, I'm late to the party...this was my 3rd time here & I had never been on this side of the restaurant before! I was blown away by the decor, absolutely loved it, I mean look how stunning! This place is such a hidden gem, who would have expected this to be in a strip/plaza, surely not me. The other side of the restaurant is nice too, but this side is just so bright, cheery & esthetically pleasing, while the other has a more dim/demurely lit vibe.\n\nOk on to the food...we ordered SO MANY things...crab & cheese wontons are some of the best, pork fried dumplings were fantastic! The sesame chicken was plump & delicious, not sicky sweet. Rice cooked to perfection! Pork bao buns were good. All slush drinks ordered were nice: apple (tasted like a jolly rancher), passion fruit, and honeydew with added strawberry boba...Was not impressed by the amount of beef in my \"beef\" lo mein, but it was cooked perfectly and tasted good. Also, didn't care for the sesame balls & pumpkin pie, but OVERALL those little things don't make me like this place any less.",
    "I had been meaning to try Szechuan Opera for quite awhile (after walking by and smelling some amazing aromas)! We got the veg dumplings, veg lo-mein and the spicy crispy style tofu. Everything was soo tasty and delicious. The tofu was hot and so crispy!! Some of the best prepared tofu I have ever had and so spicy! I loved it. Great service and friendly staff. Huge dining space and really cute decorations, even in the bathroom! I would definitely come again.",
    "I have only been here once. I will definitely be back for their soup dumplings, they were delicious!! They also had the best egg rolls, I've had in Rochester yet. Very crispy and nicely packed. \n\nI ordered an expensive spicy chicken dish and while it was really good. I was disappointed in how small the chicken pieces were. It was fried  much like general Tao's but no sauce, all peppers and dry rub. It was super hot, almost too spicy. \n\nThe chicken was cut so small by the time it was battered and fried, when you took a bite it seemed like it was batter and not much chicken\n\nDefinitely not worth the 20.00 price tag on it. \n\nMy BF ordered the beef noodles and there was barely any beef in it. The flavor was excellent, but they were just really skimpy on the amount of protein in their dishes. I'm a stickler for having dishes well balanced and this was way more noodles than beef. \n\nPork fried  rice was really good and had the amount of pork you would expect. \n\nThey also automatically put a tip on my online order for pickup, so if you order online make note. I couldn't figure out how to take the tip off. I tip a couple of dollars for pickup, but this started at 15% plus they added a 1.00 convenience tax on my bill. Not really sure what that's about",
    "Didn't realize until I got there that they have no indoor dining! Oops... but they took orders there and the food was ready to take home in about 15 min.\nI had the garlic chicken that comes with peppers onions mushrooms and celery sautéed in this amazing sauce. John had the sesame chicken which was also good! Both were decent sized portions and came with white rice.",
    "The food is always delicious! and the service is amazing anytime we go there for dine in or take out!!",
    "I don't know why I waited so long to try out this place. Me and my wife suddenly craved for Dan Dan noodles after our recent trip to NYC. We immediately googled where we can get one in Rochester. \nThis place popped up. We go to Park Ave very often but always missed this place. \nWe ordered Dan Dan noodles and Mapo tofu. Both the dishes were delicious. I personally feel it could have been spicier but they were packed with flavors. Definitely the best Chinese food we had in Rochester. \nWe had to pick up our order as they don't do Dine-in yet.",
    "Outstanding!!  Ordered on  uber eats and was not disappointed!\n\nI am a huge fan of mapo tofu and their does not disappoint ... authentic szechuan heat and flavor. Can't wait to try more!",
    "Our second lunchtime visit has confirmed this as a favorite. Tried DanDan noodles as an appetizer after seeing it on TV. very tasty. Kung Pao Chicken was great; not too spicy with a good mix of textures. Sesame Chicken was good but will go back to General, since we like it spicier! Service prompt and friendly.",
    "Worst Chinese restaurant I ever visited and expensive besides.\nService and ambience was fine, but the food was awful. Maybe they were having a bad day?",
    "I ordered the sesame chicken which is one of my fav dishes and enjoyed it! We walked in without a reservation on a Friday night and sat down immediately. I really liked how the bathroom was decorated as well, there was a very pretty sink painted with fish.",
    "Recently I decided to come back here after a disappointing first impression, and the difference is night and day. \n\nAs soon as you walk in, there were multiple staff on the floor and the restaurant was very packed. You could tell this place is a fan favorite. Once we were seated, we were promptly asked for our drink orders, with water delivered shortly after that. We had a wonderful gentlemen serve us, but the down side is that no one seems to speak English very well. For example, when you order food, you have to point to the items on the menu. \n\nThe food came out at varied times, but was hot and fresh tasting. The prices were a little on the higher end, but the portions were adequate. The Hot and Sour soup was delicious and wasn't overly spicy. The Dry Hot Pot Fish Fillet was full of flavor and the fish was moist. The Singapore Mei Fun noodles were tasty and came out with plenty of veggies as well. \n\nI was impressed with the quick service and the ambiance of the restaurant. At times I did feel a little rushed, but I think the staff was just trying to stay on top of everything. Between the delicious food and the atmosphere of the restaurant, I am inclined to call this place a new favorite. My favorite dish here so far is the Dry Hot Pot!",
    "Doesn't look too exciting from the outside but the inside is a whole different world - very cute and so many meal options!!",
    "One cannot force customers on how much to tip. First forced us and later after few back and forth on it is customers who determine the tip amount, waitress serving us got very furious and angry. She angrily stared at us and was constantly forcing us to increase the tip amount. Later, she rudely took away the check and threw it in the trash bin. We dine out very often and have been to this place numerous times but never had such experience. It was very shocking and we were disappointed that our evening was ruined. Also, sad that we will never return to this place despite the food being really good. We've talked to the front staff and hope they will rectify their service and train their associates well.",
    "I don't like the owner or his food. It's too expensive and it's not enough. Service is OK but it aint worth the trip and the ambiance is cheap and not authentic enough ​",
    "Food is really good. I love it!\nIt's the best authentic Chinese food around here\nbut expensive！",
    "It was better than expected! I got the Orange Chicken with fried rice. Plenty of food for a reasonable price. We got take out for my step brothers belated shortly after Christmas birthday. Everyone else in my family was happy with their choice as well.",
    "I've gotten take-away and dined in a couple times. I like Szechuan peppercorns for their tingling/numbing sensation and mood boosting effects. I always wake up happy the next morning after having spicy Szechuan dishes. \nBrief assessment followed by yes/no if I would order again. I do this for my future self. \n\nE4. Pumpkin Pies and Sesame Balls - delicious, yes\nQ10. Eggplant with Garlic Sauce - good, could be more dry/crunchy, yes\nF16. Boiled Fish in Hot Chili Oil Sauce - spicy, also with wood ear mushroom, 1/2the sauce is literally oil that you need to skim off. Yes\nE9 Egg Custard Bun(3) - smooth and creamy, yes\nE9 Crispy Durian Puff(3) - expensive, depends. yes. \nV8. Sea Cucumber w. Mushroom Dumpling (3)- interesting to try at least once. The outside is the cucumber stuffed with mushroom. No. \nG5. Soupy Style Fish - spicy, oily, can't remember. \nV1. Xiao Long Bao (6) (soup dumpling). Ok in taste, not enough soup. No\nF5. Smoky Pork in Szechuan Style - slices of smoked pork with some kind of leek or green onion.  Basically a plate of soft bacon. No\nE12 Ying Yang Lava Bun (4) - soft custard. Yes\nQ6. Sauteed Yam with Wood Ear Mushroom - good, simple veg dish. Yes, but way overpriced. \nH3. Cumin Style Lamb- two peppers =spicy. Was good, but not if you can't take the heat. \n#Orange chicken - good, nice and crunchy. Yes\n#Jasmine Milk Tea - delicious, yes. Less sweet. \n#Steamed Pork Rib w. Pumpkin - pork comes on the bone. Good flavor. Too much work. No\n#Sliced Pork Tripe w. Red Chili Oil - got this for the spice. Good spice, but didn't care for the texture of tripe. The thin sliced pork was good though. No\n#Steamed Pork Dumpling (8) - good flavor. Not dry. Yes\n#Steamed Veg. Dumpling (8) - green veg dumpling. Was ok. No.",
    "This is a small restaurant hidden on Park Ave with lovely food. I had the scallion pancakes and Dan Dan noodles for about 20$. I did take out Bc of the apocalyptic times in which we live, but the indoor area was beautiful. The service was fast, and parking is easily available on the parking lot. The scallion pancakes were the perfect amount of crunchy. The Dan Dan noodles looked a little undersauced, but the sauce was all at the bottom and the dish just needed to be mixed. All in all, will definitely be going back.",
    "Okay, this place has my heart. I lived in China for a year and I really miss the food. This place reminds me of living there and eating the food. I love their dry pot options specially the lamb dry pot. Also, their sautéed green bean, egg and tomato, garlic eggplant and their potato with peppers are to die for. Honestly, I've never been disappointed going there and yes their prices are a little high but this isn't regular Chinese food. Their stuff is worth it!!!! NOW GO!",
    "They are now open for dining in, and we recently visited for the first time for dine in.\n\nThe service is great and quite quick. There was a bit of confusion about dessert, they brought that item to us first.  I guess I should have specifically said we wanted that after the other items.\n\nThe pork and preserved vegetables is tasty though I did not taste the preserved part.  (I expected to taste vinegar more than I did.)  The mapo tofu is still delicious, as are the cucumber with garlic and noodles with soybean paste appetizers. \n\nI'll certainly dine here again.",
    "This place as others have said is absolutely stunning it really is... staff is efficient and very matter a fact. Not dismissive but not really friendly either? We ordered a few things to share:\n\nWontons in Chili Oil.. just YAS. ORDER THIS!\nFried Dumplings no they were a meh\n\nSmoky Pork w/ Mushrooms I should have asked it was basically bacon my bad but it was tasty but not my jam. \n\nDiced Chicken with Peppers & Dried Chili's in Chongqing Sauce. This was very tasty & hot! \n\nDried Sautéed String Beans these were tasty as well. Well cooked with garlic and etc\n\nWith our meals we also got white rice.\n\nThe food is tasty just an FYI Szechuan is HOT but they also have on the menu regular  or Traditional Chinese Dishes. \n\nWhat was cool is the diversity of the clientele so.. than you end the meal with the bill you get these small little drink bottles of almost like a orange dreamcycle. It was good.\n\nAll in all the food was good, would I come back yes.. ask questions. \n\n3.5 for service \n4 for food\n4 for decor \n\nThey are in a shared parking lot on Park Ave. \nI'll be back",
    "The food quality and store decoration are comparably the most close to the authentic Chinese restaurants in this region Never expect I can have hometown dish squirrel fish in the United States... Amazing!",
    "Szechuan Opera is a great addition to the Chinese dining scene in Rochester. It is tucked away in the corner of a small strip mall on Park Ave, so it's easy to miss. However, once you walk into the restaurant, it will be hard to forget. It's a (dare I say) beautiful space. The owners have really put some thought and money into the interior design of the restaurant. \n\nNumerous Chinese Opera masks adorn the restaurant walls and Chinese characters emboss the table tops. Even the chopsticks are top quality. All these decorative details make Szechuan Opera the most upscale and aesthetically appealing Chinese restaurant in Rochester. \n\nAs far as the food goes, Szechuan Opera is no slouch. The restaurant is easy on the eye, but also delicious to the stomach. The dishes I've liked include: Crispy Cucumber with Garlic appetizer, the Beef Dry Pot and the Eggplant with Garlic sauce. The Beef Dry Pot was the standout dish for me. The hot and sour soup was just okay (a little too sweet and not spicy enough). \n\nService is okay. Not the friendliest, but prompt. The pricing is fair and the portions are pretty generous. Overall, one of the better Chinese restaurants in Rochester.",
    "Found this place on Yelp and it was a delightful lunch. Food was fresh, well prepared, well seasoned and delicious.",
    "I didn't have a great experience with a  take-away order. Walked in, placed an order. 20 min later... The order was mixed up, and I didn't find out until I walked about a mile to my residence and opened it. Called to correct, they wouldn't deliver it. So....another schlep to and fro to retrieve dinner. They added an egg roll order for my trouble. The meat dish was requested to be mild. It was way over-spiced. Spent 15 min scraping and dabbing the pepper flakes and chili oil until I gave up. It's in a cool location, tho.",
    "I just spent 99 dollars on the equivalent of dog food and children's EZ Bake oven desserts. This was overpriced crap. I wouldn't feed it to the rats and maggots hanging outside of waste management.",
    "If you're a fan of spicy food then this place is for you! The restaurant is very unassuming since it's in a plaza but when you enter the restaurant is very well decorated. As other reviewers have mentioned it really is detailed to the max and transports you to a place that is not park ave. The service was friendly. It's always very awkward for me to go to a Chinese restaurant and they'll greet and ask me questions in Chinese and I have to say sorry I don't understand anything. There was what I am assuming was the manager in a full on suit and wandered around with a displeased face. Weird....but anyways...\n\nWe started off with the scallion pancake and the wonton in chili sauce. The scallion pancake is not a good value for your money. The pancake is thin and very greasy. There was little flavor. The wonton in chili sauce however was delightful! The chili sauce is VERY oily, but I just loved the sweet and spicy flavors I didn't really care. Make sure you really smother  the wontons into the sauce. The wontons themselves were soft and the filling was nicely cooked. \n\nFor entrees I had special dry pot. The presentation is impressive. It comes on this huge pot with four legs and under the whole thing was a portable burner to keep everything sizzling! There is a LOT of food. I loved all the variety of veggies, especially the mushrooms. I usually don't like peppercorn but in this dish I didn't mind it. It didn't numb my tongue too much. The fish are tender, the spam I could pass on since it is just spam, the beef and shrimp were also cooked so well. This is also so spicy, like a lingering spicy! It really satisfied my need for spice that night. \n\nI forgot what my boyfriend had so won't comment on that. But overall, I will definitely be returning if I'm craving spicy!!",
    "Pretty good, they are still only doing take out, no dine in option. I had the wonton soup and ma po tofu. The wonton soup was not what I was expecting, the broth is quite dark and a unique flavor, didn't love the broth. However, the wontons were delicious, those exceeded expectations. They were tender and full of flavor. The mapo tofu was also very flavorful, close to authentic, I'm actually in China flavor. I would recommend. I would definitely visit again to try more menu items and dine in.",
    "Finally made it to this place! And, it is as people say! It is one of the best, if not the best Chinese restaurants in Rochester. The ingredients are fresh, the vegetables are prepared just right, not soggy and overcooked in sauce, the selection is great. There are some quite exotic items to try for the more adventurous tastebuds (chicken feet being one of the less exotic), but the dim sum items are definitely \"top notch\" for me and the platters are awesome, too. No cart, but no problem. It's a little pricier than most Chinese restaurants in town, but worth it considering the quality of food and the service that you receive. I'd encourage people who tend to order just one dish \"American style\" to take a chance and eat family style\". Sooo much better.",
    "This one of my favorite restaurants in Rochester. They haven't been doing inside dining the last few times I've been there but I order take out and DoorDash from them a few times. I absolutely love their claypots, Dan Dan noodles, and Mapo tofu. Quality is amazing and price is great. I haven't had better Szechuan food in Rochester. A must try",
    "I had the shrimp mei fun. The portion was extremely small for $12.99. The shrimp were so small you could barely find them. It had a strong pepper taste as well as onions. The spring rolls were gummy and tasteless. They do not give fried noodles or fortune cookies. Way to expensive for what you get.",
    "I had the egg drop soup & chicken lo mein. Very tasty and service was friendly and efficient. Located in a very cute area of Rochester, I was happy to find street parking while I was passing through. Very close to the Eastman Museum.",
    "I have decided to come out of Yelp retirement to profess my love for Szechuan Opera, the ONLY place in Rochester to get legitimate Sichuan food, like they serve in China. I hate when someone claims to be an \"authority\" on a particular category of food, but I feel that after living in China for the past nine years in a household with two Chinese women, eating primarily Chinese food both at home and when dining out, I have developed a palate that can distinguish good Chinese food from not good Chinese food. \n\nThis is good Chinese food...if you order right. \nAnd like spicy food. \n\nSzechuan Opera does not tone down its dishes to soothe the tongues of the uninitiated; rather, it drops them in front of you and forces you decide whether or not you really like Sichuan food. \n\nWe ordered the Beef and Tripe in Chili Sauce, Peking Duck buns (gua bao with duck), Special Dry Pot, and Shrimp Mei Fun (for our toddler). Everything was excellent. We especially enjoyed the dry pot, which featured all the spices, ingredients, and ma la tingle that we expect when dining in restaurants in Beijing. The proteins included beef, fish, shrimp, and spam (SUPER authentic!). There were slices of lotus root, wood ear fungus, potatoes, tofu skin, and broccoli. \n\nThere were no ingredients added to help westerners feel more comfortable, like snow peas, baby corn, or bok choy. It was like a breath of fresh (or chokingly spicy) air when compared to basically every other Chinese restaurant in the greater Rochester area. Yes, even Tsingtao House.  I'm putting them on blast after spending $120 and not getting anything that satisfied my Chinese food cravings. \n\nA pro tip regarding the dry pot: combine the leftover dry pot sauce and ingredients in a wok with new ingredients the next day, prepare some rice, and now you have another meal! We had leftover imitation crab legs, lobster balls, thinly sliced meat, scallops, shrimp, and spinach from hot pot and the result was a huge bowl of delicious spicy food. \n\nThe beef and tripe was just right (aka swimming in chili oil), the duck buns were probably the second best gua bao in Rochester, and my son loved the mei fun, which had the perfect wok hei flavor that is often missing in local restaurants. \n\nThe 50 minute drive for takeout was totally worth it and it is safe to say we definitely be back, once our colons have recovered.",
    "Overall amazing food ! I've dined it once in person and the restaurant has a clean, close knit interior. Since the pandemic, I've gotten take out multiple times and every time the food is consistently fresh and delicious. Their portions are similar to when you would dine in person (which people overlook often times).\n\nMy favorite dishes are the garlic style sauce dishes, which you can order with various meat options or tofu. To me, it's a perfect balance between sweet, savory and the right amount of heat kick in the end. From what I hear, it's one of the most authentic Szechuan food choices in Rochester!",
    "The best Chinese/Szechuan restaurant in Rochester. I was a student at U of R, used to eat here every week. The service was great, food was great! The decoration is beautiful, and most importantly, this place is clean!",
    "Terrible service. Great Food, although it was 30 min late for one round, and 20 min for the next. Owner wouldn't comp the very delayed and cold meal. I protested and she refused. Terrible service. Great food.",
    "This is an update review for take-away during the COVID-19 pandemic. We ordered our food online and were able to pay there, too, which meant the transaction was almost entire touch-free. When I arrived to the restaurant, everything was ready on time, and our order was complete and piping hot. There's a doorbell you ring, as part of a plexiglass partition that separates you from the server. You communicate with the masked server thru the plexiglass, and then a little window is lifted, and your bag of amazing goodness is passed to you. It was sanitary, protocoled, easy and **DELICIOUS!** Also, our portions were huge so we got almost three meals for two people out of what we ordered -- we'll be back for SURE! We ordered Chicken Fried Rice, Ginger & Garlic Stir-Fried Chicken, Wontons in Chili Sauce, and Ma Po Tofu.",
    "The flavor is there. Authentic and delicious. However, there where some compositional and balance issues. \n\nThe dan dan noodles had way too many noodles per sauce/ratio. Also, there were no textural elements like green onion or cucumber. \n\nThe three pepper chicken was authentic Sichuan. Great flavor. Wish they put in onion or other crunch (perhaps the chicken should be crispy).\n\nThe eggplant with garlic sauce was perfection!\n\nWe got a sweet and sour chicken, too. The sauce was great (with a cherry essence), but there was hardly any chicken!! I'd say the nuggets were 80% fried batter. Also, there was no pepper or onion in the mix, and only three little pieces of  pineapple. \n\nSzechuan Opera could be next level if they don't cut corners!!!!",
    "Poor quality, it was fine in 2019. Now it's just disgustingly annoying. They must have changed the chef or something. PLEASE DO NOT GO THERE. The price was high as usual, they reduced the portion and quality. Some dishes are extremely salty and they lost the craftsmanship. Just avoid this place!!!!!!!!!I am beyond disappointed and frustrated.",
    "Authentic af\n\nForced word counts by Yelp remind me of English literature in 8th grade",
    "I have mixed feelings. I'm glad that a Sichuan restaurant exists in the city of Rochester, but the food, at least what I ordered, was really just ok. Compared to the many Sichuan restaurants of Pittsburgh or Chicago, very underwhelming. But perhaps I ordered wrong.\n\nDish 1: spicy and sour pork intestine noodle soup. Pork intestine was nice and tender as it should be; it's my favorite part of the pig. The noodles were adequate, not too fresh. But the broth was just...missing something. It was quite sour, and bright red, but lacked a certain kick that I've had when I get similar dishes elsewhere.\n\nDish 2: lotus leaf sticky rice. Admittedly not a Sichuan dish, new to the menu. It had the wonderful fragrance of lotus leaf, but didn't taste that fresh; the sausage and shrimp inside both just seemed prefab and stale.\n\nAgain, it's totally possible that I just ordered wrong; maybe the dry pot dishes are better (and some friends have implied as much to me). And there isn't better Sichuan food in the Rochester area that I know of. But there's better Chinese food from other regions.",
    "Delicious! Party of 9, everyone was delighted with their meals!\nItems ordered:\nBeef Dry Pot - spicy good, tender\nChicken Lettuce Wraps\nCrab Rangoon\nEgg Rolls\nPan Fried Dumplings\nSpring Rolls\n+ alot more but unable to choose any more selections",
    "We went to Szechuan Opera yesterday and loved it! The ambiance is really cool and the food we ordered was great. We ordered soup dumplings to start (which were super delicious and our 8 year old loved them), followed by a \"family style\" order of orange chicken, shrimp and broccoli and the chicken dry pot. My husband ordered the dry pot extra spicy was a bit too spicy for us but it tasted very good. Now we know for next time to not order anything spicier than it already says it is in the menu. The orange chicken was the best we have ever had. Definitely will come back next time we are in Rochester,",
    "Szechuan Opera was  \n\nWe started with the wontons in a spicy chili sauce. The sauce had so many different flavors going on and was delicious! \n\nWe also shared the beef dry pot(more than enough for two people). This was definitely SPICY. It was the make-your-nose-run-but-you-can't-stop-eating-it-because-it's-so-good kind of spicy! \n\nFor dessert we shared what I like to call \"bubble tea soup.\" It was a warm, semi sweet wine soup with small, chewy rice balls and other things(not sure what else was in there ‍). It was not what I expected, but it was actually quite delightful! It is a HUGE serving and more than enough for two. \n\nThey also give you a little fruity yogurt like drink with your bill that was quite tasty! I'm assuming it's to help settle all of the spices in your belly \n\nI seriously cannot wait to come back here and try some other menu items and I highly recommend it! The interior is incredibly and I really appreciated all of the little touches they put into making your dinner more of an experience. \n\nInstagram: @foodiewithasideofadventure",
    "Love this place for good Szechuan food and quick service. There is parking, but the lot is usually full during peak hours. \n\nI have tried multiple items on the menu, but some of the following stood out which i would highly recommend!  \n\nthe beef tendon appetizer is a cold dish with thinly sliced beef tendon in a spicy chili sauce, topped with cilantro and green onion. of the items i always get is the fish dry pot, which isn't too spicy despite the peppers. cumin beef is delicious if you love the fragrance/taste of cumin. Something I ordered for the first time is the chendu shrimp. I loved the flavors, but my husband didn't care for the fact the shrimps had shells on. \n\nSomething I've been meaning to check out is the spicy soup beef! It's a must try in any Szechuan place, so I'll be back soon :) \n\nAt the end of your meal, the wait staff will deliver a sugary asian yogurt drink along with the check. A yummy asian treat to end a savory meal.",
    "Fancy decor and big plates (literally). Food is no doubt to be good, although on the pricey side. Very flavorful. But may want to skip dim sum sections. After all, this is a Szechuan restaurant. We had to ask for less spicy. The dishes we ordered and had ordered in the past (not many varieties) we recommend mapo tofu, string beans, twice cooked pork and cumin lamb. (ps. Tea is good but not free.)",
    "Beautiful place with delicious food! If you like spicy, this is the place to go. The staff was nice and it wasn't too busy. A hidden gem!",
    "Tried something new this time and bought the chicken garlic sauce style and side of fried rice. The fried rice wasn't amazing but the chicken was sooo good! And as always, I love the pan fried dumplings. Yum!\n\nUpdate: We order again last night and bought several \"new\" items. We bought the beef garlic sauce style, pork lo mein, pork fried rice and wonton in chili sauce & they were all so good! Wonton's were spicy when eaten solo but mix in with rest of items, more tolerable. My boyfriend and I love the dumpling dipping sauce and poured it over our plate, made it so much more flavorful. Also, side fried rice is bland but pork fried rice was delicious. All of it was delicious. Highly recommend.",
    "Yummy and has items on the menu not found at other Chinese restaurants (soup dumplings!). Presentation is gorgeous and the atmosphere is different in a good way. Would have given a 5 but beer was barely chilled. Not sure why it was almost room temp.",
    "Szechuan Opera is easily the best Chinese restaurant I've been to, ever. You wouldn't really expect it from the outside though considering it's in the same plaza as a 7-11 and Zoom Tan. But do NOT let that deter you. This unassuming restaurant is a jewel of the Park Avenue neighborhood. \n\nThe amount of incredible detail put into the atmosphere and decor here is something you don't see very often at all. It's a small space, but the very high ceilings make it feel large and welcoming. And the detail! There's so much to look at, from the art on the walls, to the pillows, to the inscriptions on the tables. Thought was even put into the utensils! The gorgeous blue seating gives a luxurious feel.\n\nThe service was super quick, attentive, and friendly. The menu is large, which is just slightly off-putting. They do have a section of traditional Szechuan food, but I feel they would be better off limiting the other offerings and focusing on their speciality! \n\nWe ordered the spring rolls (which are fried AND vegetarian - yum!) and at only $1 a piece, they make an awesome starter. We also tried a bowl of egg drop soup (which was only $2) and it was good, but different. I could totally be wrong, but I think it contained seaweed in addition to egg, which gave it a bit of a fishy taste. No complaints, though! It was a cool change. Oh yeah, and draft beers are only $3 while glasses of wine are $6! Such a steal. \n\nFor our meals, we got a mixed vegetable lo mein and tofu dry pot! Both portions were huge, and we were able to have leftovers the next day. The lo mein managed to maintain a delicious flavor without dripping in sauce and oil, which is rare. The dry pot came in the coolest bowl that was still heating it up on the table. It contains a LOT of chili peppers, but they're easy enough to eat around if you need to. After dinner we were presented with these little bottles that are the Chinese equivalent of drinking milk after eating something spicy! It's kind of like a more liquid-y yogurt. It's definitely a nice touch, as I imagine most people need it after their meals!\n\nI can't wait to go back to Szechuan Opera, and I'm also looking forward to trying their $8.99 lunch special Monday-Friday! Thank you for such an amazing experience!",
    "This place hasn't even had their grand opening... but I heard about it and I was there! It opened sometime the week of April 15th. It is absolutely beautiful inside. The owners said they spent a lot of time remodeling the space and brought decorations over from China. You can tell that a lot of hard work went into it. It's a very warm, inviting, cozy place. They booths are huge and very lush. I just can get over how gorgeous this place is!\n\nNow to the good...we got the fried dumplings and spring rolls for apps. The spring rolls were good, but the dumplings were delicious! We also shared some dishes:\n\n*Kung Pao Chicken-one of my 2 favorites \n*Garlic Sauce Pork-my other fave\n*Sesame chicken-it was sesame chicken, a little tough for my liking. \n*\n\nThey do have a bar area and as of right now, they have quite a few beers and only 2 kinds of wine-Chardonnay and White Zinfandel. I don't know if they plan on having booze or not. The people who took care of us were all so nice and happy that we were there. I think this place is going to be a big",
    "If you have to ask \"is this food hot?\", then it's probably too hot for you. If you look at their printed menu, there is a fire-spewing dragon right above the cumin dishes, which I would take as a gentle warning. Holy shit, was it HOT!!!!!! Unfortunately, it was dry, too. They take those hot red Chinese peppers that most szechuan places put in whole (as to make it easier to remove before eating), but not this place; they chop them up into small pieces, making it nearly impossible to remove all the tongue-burning pieces from the food.\n\nThe garlic-style dishes are more like what Americans are used to (and aren't nearly as hot or dry).",
    "The location is ideal but the food was average at best. I ordered shrimp fried rice and egg rolls. Shrimp were very small and very few. The egg rolls were also very small. Not what Chinese restaurants in this area typically serve.",
    "Szechuan Opera really is the most experiential way to eat Chinese food! This place is very authentic. We forgot we were even in Rochester! It was like we traveled to China as soon as we walked in. Super homey and welcoming. The food was super flavorful and delicious! My favorite dish is Sliced fish w.boiling spicy oil and Orange flavor beef.\nThanks for a wonderful experience you guys!!! \nI'll definitely be spreading the word in a post on my website",
    "Very tasty meal. The dumplings were delicious. The chicken lo mein came in a portion big enough for 2 with a nice texture for the noodles. A pleasant surprise was the chewy pumpkin \"pie\" dessert treats, covered with sugar. Tasty fried spring rolls too. We really enjoyed the pork lettuce wraps as well. Very flavorful.",
    "Here is the good: relatively nice ambiance and decoration \n\nHere is the not so good:\n1. Tried chicken with green and chili peppers (in the Szechuan section of the menu), and got dried chili peppers with some small pieces of highly battered chicken. Who eats that much dried red chili peppers? And why put so much batter on the chicken? Very disappointed.\n2. Kind of big deal: the main door to the restaurant opens inward, which I believe violates OSHA requirements. I am pretty sure that public places with capacity of 50 or more, must have their exit doors swing outward. That allows people to exit quickly in case of emergency.\n3. Egg rolls do not appear to be made in-house.\n\nThe table next to us ordered an interesting dish that came to the table sizzling with a flame underneath. I wished I had tried it, but I am not sure I will go back to do so.",
    "The food is always good, and the customer service is top tier too! A trip home isn't complete without a visit.",
    "Delighted that Rochester NY has an amazing Szechuan restaurant for all my Chinese food cravings. The 水煮鱼 is flavorful and their dishes are very authentic. Love supporting this local business!!",
    "The location is convenient. The environment and decor were very pleasant. I went at about 8-9 pm on a weekday and it was quiet. The flatware and plates were all cute too. \n\nI got the mapo tofu and it was decent, but definitely not the heat mapo tofu I've had around Rochester. There wasn't much heat to it and the chili oil/sauce's flavor didn't add much for me. My husband got a vegetable noodle dish (the mixed vegetables meifun) and it was extremely bland. There was no added sauce to it. The vegetables were extremely lacking. Definitely would not order that again. \n\nI would give it another chance and order different dishes. The vegetable dishes didn't sound very appetizing so I don't have my hopes up about it.",
    "Food was good but small portions. \nVery very slow service. I think they need to hire more waiters or have their waiters do their job. Some people were either standing there doing nothing while 1 person is attending all the tables.",
    "Our visit to Szechuan Opera was a real treat. The decor is gorgeous, and the wait staff is friendly and helpful. The menus are modern and not overwhelmingly complex. Many familiar dishes from Chinese, American roots, plus a huge list of truly wild eating, including frog, something called squirrel chicken and, believe it, or not, spicy pork brain. We steered clear of the gnarly organ dishes and focused on more familiar dishes. We ordered eggrolls, scallion pancakes, hot and sour soup for our appetizers. All terrific. Or entrées were Chicken In Chongqing Style (Chili Chicken) this is a fiery hot dish, using Szechuan peppers that will numb, your tongue, so be prepared. It was also absolutely fantastic, 5-star, though, definitely not for the faint of heart. We also enjoyed Tofu Dry Pot Style, and a classic chicken lo mein, Szechuan Opera is definitely a memorable dining experience, one of the top Asian restaurants in Rochester, New York. We love the mixture of classic American Chinese food alongside authentic Szechuan cuisine and plan to be back very soon.",
    "I went here a couple days ago. I ordered the vegetable lo mein. It was extremely oily as any good lo mein should be. One thing that I thought could be improved with the dish was the carrots. They were tiny little limp strings that didn't add to the dish at all. Much better if they were sliced. Also, the broccoli was not fresh. Very much could have been improved.\n\nThe service was also somewhat slow. For a restaurant that only had a moderate number of guests and a dish that was extremely simple, I would have expected it to come out much sooner.\n\nThis was a meh experience for me.",
    "The inside of the restaurant is awesome.  The food is even better.  My favorite item is the Singapore mei fun but everything we tried was super tasty.",
    "Got horrible food poisoning. Was up all night sick as a dog. I hope no one ends got sick tonight.",
    "Great food ! \nDry pot is our favorite! Spicy !\nWe loved inside of the restaurant, but now we can enjoy take out ! Always busy !",
    "Best Chinese food in Rochester. I am not originally from Rochester, so I have to admit that I am VERY picky when it comes to any type of asian food. I have been disappointed with most of the asian food in Rochester, but not with Szechuan Opera! The quality of the ingredients and flavors are excellent. I would recommend the Dry Pot or Diced Chicken. \n\nI have dined in before and it was a pleasant experience. Very clean and the decor is fun. \n\nBut I am really writing this review on the take-out I have ordered during the shelter-in-place. The food was great! Big portions and super fresh. I would highly recommend to any craving spicy, savory, yummy comfort food!",
    "Best authentic Sichuan restaurant in Rochester! Double cooked pork is done right. Our go to place when visiting family in Rochester. In my opinion this restaurant is up there with some of the best here in Los Angeles",
    "Bonus points for being open on Sundays. The décor is just fantastic. You can tell whoever designed this place really went above and and beyond. The food was good and came out quick. My only qualm was there was only one server who seemed a bit quiet and shy, so it did take awhile to be acknowledged and order. Other than that, I did like it and would return just for the décor alone.",
    "Just ordered to go from here. Terrible. \nThe fried rice w/ egg and veggies was lacking the egg and veggies.  I'm glad I paid extra for it.  It was just fried rice, that seemed to me like it has been sitting in a steam pan for hours, hence why there was no flavor.  \nI ordered the Ma Po tofu, which had so many good reviews.  Disgusting!! Not only did it taste like spicy nothing, it had the consistent of snot.  No veggies.  \nThe only reason this review gets an extra star is for the crispy cucumber with garlic.  100% delicious and would highly recommend.  The flavor was on point. The cucumber was fresh and had crunch.  The sesame was the perfect amount.  And the fresh herbs they used!!!  Yum!!  \nOther than that.... Probably won't order from there again.  It was over priced for a meal that I throw in the garbage.  Usually I blame what ever food service that delivers the food.  But Grubhub was at my door 18 minutes after I ordered.  I've never had food come that fast before.",
    "My daughter and I stopped in for lunch. It was a Saturday afternoon midway between lunch and dinner and there were plenty of people there, which is always a good sign. They have a large and creative menu. The service was great. We both loved our food and the ambiance/decor. Will go back again for sure.",
    "Really easy online ordering which was ready very quickly! Everything was delicious but we liked the pork buns, wontons in chili sauce, and crispy cucumbers the best. super messy and super spicy but excellent if you know what you are getting yourself into!",
    "Pretty good, we ordered some Szechuan things and they were really spicy so be careful! Cumin beef looked like it was just covered in mostly peppers. However no one greeted us when we entered the restaurant and took us five minutes to get seated when there were obvious spots open.  Didn't seem that busy. Other wise food good but don't expect service.",
    "Absolutely beautiful inside--you'd never guess how nice the ambience is from the outside! Best scallion pancakes I've ever had. Service was incredibly friendly and fast. A new favorite for us!",
    "Amazing food. The prices are pretty high compared to other similar style restaurants in the city, but it's understandable since this is the only spot with authentic Szechuan dishes. Everything ordered from here is always awesome!",
    "Be very careful! I ordered tonight and get poisoned together with my girlfriend! I think they just changed cook and manager. Do not order especially for take out! Or you can even not prove that you get poisoned because of their food!",
    "Far and away my go-to spot for Chinese in Rochester. Very authentic Szechuan cuisine - seemingly a rarity in the region. Tons of choices and huge portions. My favorite is the boiled fish in chili oil and the dry pot beef. As to-go options, they do a really nice job packing everything up. For sure one of our favorites when we do a carry out night.",
    "Takeout experience was disappointed. Chicken was tough. How this is rated no.2 in Rochester is misleading. Search for quality chinese continues.",
    "Awesome Szechuan food. So satisfying. My sons general Tsos chicken was a little bit of a let down - a lot of bits were mostly breading that were hard to chew. Otherwise all the other Szechuan dishes were delicious af",
    "Environment is really good and the food is traditional Chinese food except the price is a little high.",
    "Everything we ordered was a amazing! What a little gem hidint out in a strip mall. This is what I would expect in that building on the corner of Andrews and State St. Loved the beef and tripe in chili sauce appetizer.",
    "True to it's name, if you like spicy food, you'll love it here! They have deliciously authentic food with a gorgeous interior that is so beautifully detailed, you could be in old China. \n\nThe lettuce wrap filling was SO delicious! Most of the time, it's over salted and needs the balance of the lettuce to make it palatable, but I could have eaten this one completely on its own. The sizzling bowl crispy rice was such an interesting flavor, I wasn't sure if I liked it or was intrigued by it. The answer wound up being both. The third dish's name is escaping me, but it came in a beautiful serving dish with its own heating element underneath it. \n\nThe only detraction is that the service was a bit slow. I'm not sure if it's because it's a relatively new restaurant and the servers are still learning, or if it was just the nature of the place. Despite their speed, the servers were gracious and attentive. \n\nSuch a perfect hidden gem, I will be going back again and again!",
    "TLDR: great atmosphere, great food, not great service. \n\nPrefacing this by saying that I am writing this review very cognizant of the fact that this restaurant had JUST opened. I was not expecting them to be perfect. \n\nMy husband and I came here the day after the restaurant opened, we were so excited! It is GORGEOUS inside. Truly. We started with steamed dumplings and scallion pancakes which were fantastic. I ordered the chicken with garlic sauce, my husband the Seafood Noodle Soup. My chicken was awesome, they brought out the wrong rice but that's okay, they just opened. Very excited to find some more authentic food in Roc. \nHowever, they brought out my husband an entirely incorrect dish. He ordered soup, and these were stir fried rice noodles with seafood. Again, they just opened so whatever. My husband apologized and said that this wasn't what he had ordered, and the waiter fairly sternly told him that this was what he ordered. He told us that what was in front of us was soup - he called it \"dry soup\", and that it was in fact what my husband ordered. He walked away with no offer to correct the fact that my husband was not pleased with his meal. About five minutes later he came back again to explain that this was \"dry soup\" and in fact what my husband had ordered, and was pretty rude about it. His attitude read \"he'll eat it anyway, who cares?\" About ten minutes later after it became clear that my husband was not going to eat his food and that the kitchen had made a mistake, he came back and offered to turn the dish into soup for him. We declined and instead asked for the check. We paid in full for the dish. Meanwhile, other patrons in the restaurant received the dish my husband had actually ordered, so it was clearly a kitchen mistake. \n\nI have no problem that the food came out wrong. It's a brand new restaurant, they are going to be mistakes!! But to lie to our faces saying that the order came out correct, it was just a \"dry soup\" with no offer to fix it until it became clear my husband wasn't going to eat the incorrect order is ridiculous and not good business. I'm Chinese, I'm well aware that \"dry soup\" is not, and never has been a thing. \n\nI wish we had had a better experience because this would have become a go-to place for us. Hopefully the service improves!",
    "The decor was nice, and the service was good too. The food is definitely authentic Chinese and it was ok. I guess after coming here I prefer more Ameicanized Chinese food.",
    "Although the food here is good when given the receipt paying I thought the tip was already included since there wasn't a clear section to write a tip. Since usually I tip when ever I go out to eat so I just signed the receipt and left after paying. To which I was chased out by a worker, not even the waitress that was assigned to my table but a different worker. She grabbed me while I was already out of the building to tell me that a tip is required and made me fill it out outside do the store. Which I feel like is extremely unprofessional since regardless if someone tipped or not they should not be chased down by a worker to get a tip especially when tips are optional and shouldn't be required by a restaurant. I do expect better service.",
    "Hands-down the best Chinese restaurant I have been to in Rochester in 23 years. I will be recommending Szechuan Opera to friends.\n\nWe got the eggplant and green beans in the garlic sauce style, as well as two tofu dishes (one of which was from their dry pot section and was much spicier than the other dishes). \n\nAll four dishes were excellent, and the flavors were diverse and complementary. I can also recommend their won ton soup, which was full of flavor without being too heavy.\n\nWe found our server to be very friendly and generous with her time when we had questions.",
    "The situation: hungry son home from college can't find \"any\" food to eat in the kitchen. Admittedly it was low stocked due to these parents being out of town over the weekend- and not even a party was thrown by college kid. So - we decided to try a \"hot and new\" place for lunch and Szechuan Opera looked to have a reasonable lunch menu. \nWalking into this Opera gives you the immediate feeling of being somewhere other than Roc. You will be transported and feel slightly giddy until you see your college kid rolling his eyes at you.  The menu is extensive and we wanted to sample so many of the dishes (spoiler alert: we'll be back) but it was just the two of us. We opted for the lunch menu - Tofu Maspo And Shredded Pork in Garlic Sauce. Lunch items come with soup or egg roll. I hoped to order one of each for sharing but college kid doesn't share food since he rarely can get enough to eat as it is. We both enjoyed the hot and sour soup which had a just-right consistency and not too globby. The hot kick was more pronounced than the sour taste but it was still delicious.\nOur meals arrived quickly which was great since we were super hungry (and that empty kitchen at home!). As mentioned me sampling his food is a no-go, but he reported a smooth texture tofu and interesting tasting sauce. I was surprised that my shredded pork came with so many veggies too. There are a few local places that shall not be named who only give you a scooper full of meat bits when ordering shredded pork. So I was super happy. My dish was large enough to bring home leftovers for another full meal. My son finished his whole lunch.\nThe servers were polite and helpful with the menu. Our waitress really seemed to know what each dish was and how it tasted which is impressive given the size of the menu. \nWe'll be back with more people to order all those other dishes!",
    "Before I get into specific details, I'll share my general impressions and highlights. Be advised, my friend and I are both adventurous eaters, so we ordered some of the more exotic dishes on the menu, but there is something for everyone here.\n\nThe interior is new, tasteful and stylish. Definitely one of the better looking restaurants in Rochester. The style is similar to Chinese restaurants like Chen Garden, but more modern and trendy. Cozy high-seated booths along the side, a small bar at the front and tables along the rest of the restaurant. All the staff were very attentive, timely and professional. A great place to go on a date, with friends or family, but probably not appropriate for young children to run around.\n\nThe food is outstanding in flavor, presentation, portion size and variety. It's well priced for the experience. They have a wide variety of authentic Szechuan dishes, which in my opinion is what you should get here. They also had a good assortment of classic Chinese-American dishes for those who may be less adventurous or craving something familiar.\n\nI came here for an early Wednesday night dinner today with a friend. I was immediately greeted at the door and ordered a beer at the bar while waiting for my friend. Once he arrived, we were quickly seated. We got a couple appetizers to start with, the Dan Dan noodles and the intestines and beef. Both were delicious, but the beef and intestines were truly amazing! It was bursting with flavor, Szechuan peppercorns, chili pepper and I think Chinese five-spice. The texture and flavor of the meat was great as well.\n\nFor entrées, we both got the F17, which I believe was pork blood(congealed slices, kind of like sausage), tripe, fish, beef and a few other things in a hearty spicy traditional Szechuan broth that also had some rice noodles, bean sprouts, cabbage and other vegetables. It was a huge assortment of meats, vegetables and spices in one dish. They told us the portions were big beforehand and they weren't lying! Each one was easily enough for 2-4 people to enjoy family style. This was one of the best things I've eaten in my life, and was right up my alley. Spicy, savory, salty, all the flavors I love. It was actually a great value and I'll be enjoying my leftovers for the next couple of meals. \n\nThis was my first time here and I'm in love with this place and will definitely be back to try the rest of the menu!",
    "Nice new spot on Park. Well priced and tasty lunch specials. I had the Pork and Bamboo and enjoyed it very much. I'm excited to try some of the more authentic dishes for dinner--my husband is Chinese and we've eaten at all the local spots trying to find his flavors from home. \n\nThe interior might be the best part of the experience. I'm sure they spent a fortune remodeling the dining space. It has a Disney World drama to it: a fantasy take on the Western perception of China. Beautifully lit and stylishly decorated. It's pretty enough for date night.\n\nFrom my initial experience I would recommend it and I plan to go back and try more things off the menu.",
    "Beautiful decor, huge menu with lots of intriguing options, and excellent service. I recommend getting a lot of small plates and appetizers to try many things.",
    "Amazing food and service always. Beautiful interior and always very clean. Best in ROC!",
    "Straight up this place is delicious! They make their food fresh. I ordered take out online which was super simple, got there early and it was hot and ready for me to pick up. The inside decor was modern and REALLY nice. This makes me want to come back and eat in next time. The staff was really nice and friendly. \n\nFood: fried rice, General tso chicken, spring roll and crab rangoon (their menu called it wanton cheese and crab). The food is prepared fresh. The rangoon was hand made and the filling was tasty. The spring rolls were also hand rolled. Delicious on the inside with a perfect crunch outside. The chicken was cooked perfectly. Not dry at all. \n\nThere was plenty of food for 2 and enough for left overs!\n\nDef look forward to coming back and dining in!",
    "YUMMM in the mood for Chinese food in the cutest decor around ? This is the place for you ! Food came out fast and fresh with different spice levels if you want.",
    "Disclaimer..only got vegetarian food.  Spring rolls were good.  Veggie fried rice was ok..pretty much what you would expect from any restaurant.  General tso tofu was disappointing..large chunks of tofu with bland sweet-sour sauce and 5 broccoli florets.",
    "Authentic Sichuan dishes. We tried close to 20 dishes in a week while visiting RIT and were satisfied with each one of them. Highly recommended.",
    "Delicious food and great ambiance  we have recommended it to several friends, will definitely return soon!",
    "We were craving an authentic Chinese meal and Szechuan Opera didn't disappoint. Excellent meal!",
    "Great food, the only reason I gave it a 3 is because they have bottles of wine under the $20 list. I pointed at the Pinot Grigio and said we will have the $20 bottle of Pinot Grigio. They then brought over a magnum opened it, poured a little in each glass and I said wow that's $20 can we take home what we don't finish and she said yes but this is $35/bottle. Well we ordered from the $20 bottle list...she said no Pinot is not $20, it's $35....well it's listed there and I pointed on the $20 wine list menu. She said it's not $20 again...so I said ok then we will just have a glass each instead of the bottle (a magnum is way too much anyways) then she takes the bottle away and left us with 1/3 of the wine glasses filled and never filled the glass and charged us for 2 glasses. They should really update their menu and provide the correct prices for the wine list.",
    "Amazing. Always got take out here. Tucked in on park ave. Sesame chicken, sweet and sour chicken, everything is always fresh and tasty.",
    "Great Dim Sum and so many authentic dishes always served hot. Best Asian food I've eaten in the Rochester area.",
    "Must get: dried sautéed string beans, worth the slightly high price.\n\nSalt and pepper crispy fish fillet is so flavorful, reminds me of a home cooked meal! \n\nDecor is outstanding, very authentic. The restaurant is a bit small but for now, there's not a wait and the food comes out relatively fast. Tea is also served in a heavy teapot, which is a nice touch! Definitely worth a try",
    "The pick up service is very covid safe and efficient. The Dan Dan noodles are amazing, definitely one of the best noodle dishes I've ever had!! The chicken dry pot is tasty too, had a nice variety of vegetables and other ingredients other than chicken. The garlic pork has a sweeter flavor and was good too. Definitely definitely get the Dan Dan!!!",
    "Gorgeous interior and excellent service. They did not skimp on the spices. We split an order of the Szechuan chicken and definitely felt the heat. If I have any complaints, it's that they did not have peppercorns in the dishes, which I really enjoy when they number your mouth. The dishes were definitely cooked with them, but most Szechuan places will have the dish garnished with them, and they were certainly missed. They did not have any pork belly buns when we went so we want to go back and have some when they do. \nReasonably priced and well done Szechuan. Probably my second favorite in the area.",
    "The Mapo Tofu I ordered for lunch portion was inedible. It was so spicy that it burned my throat as I ate it. I recommend not ordering from this place. The dine in experience could be different. I have 2 stars for the egg roll which was decent and fresh.",
    "Food is still excellent but some of the servers are just awful. It's apparent from the moment you sit down, you're not wanted. As someone who works in the service industry, this really bothers me.",
    "Probably the best Chinese restaurant in Rochester! We had the shredded cabbage dry sautéed beef and Szechuan style spare ribs. The meat dishes are delicious and tender. But the vegetables is a little watery.",
    "Worst place to go for Szechuan Food or even Chinese food, ordered three dishes and was all terrible, cannot be considered traditional Chinese food! And to add on, they FAKED the total amount I put on the receipt and counted the amount that I did not check on the receipt!  Worst experience ever and also expensive for the food ordered!",
    "A friend of mine recommended this place and was not disappointed. Now I'm recommending it to other friends for their Dan Dan noodle, which is a must have when you're there.",
    "Had a terrible experience as a first time customer. It was recommended by a friend  but I was very disappointed. The spring rolls were mushy on the inside. I ordered sesame chicken which was very heavy and did not have great flavor also ordered the shredded beef. It was so spicy it was impossible to eat and I like spicy food. I asked the waiter to send it back and order something different. He would not let me he said he would take it back and they would try to adjust the spice which truly is impossible at that point. It came back and I was still not able to eat it he did not care did not take it off the bill. I will not come back again. The service was very slow the atmosphere was less than appealing it was very bright no music you got very small plates they did not even offer to give you a fork I had to get up and get it myself it was just an unpleasant experience overall bad unfortunately.",
    "Delicious and authentic Chinese food.  Tofu always gets cooked perfectly and the vegetable spring rolls are crunchy and luscious. A great value; 2 rolls for 1.99.  Maps tofu, lotus and potatoes with sweet and hot sauce are amazing.  The best In Rochester.",
    "I ordered from here often and I'm in love with the food. Fresh herbs, great spicing and all of the protein that I've gotten has always been consistently well prepared and fresh tasting. I think the Dry Pot with chicken or beef is absolutely fantastic. High-quality and authentic.",
    "I think it's the most authentic Chinese at Rochester. A little pricey, but I think it worth it",
    "Located in a small plaza off Park Ave, I met a friend at this newish Szechuan spot for lunch to take advantage of their well priced lunch specials. They did a great job with the decor, which helped set a nice ambiance to the room. They have huge booths for big parties, which I thought to myself would be fun at a future trip. We were a little disappointed in the options on the lunch menu though, as there were few Szechuan dishes available. They have a huge menu of regular priced items that sounded amazing, but the lunch menu was your regular chinese takeout type items. I did choose one of the few Szechuan options though, the mapo tofu. Pretty good, though I think I make a better version at home. My friend got the shredded pork and bamboo, which was not very good IMO. I want to give this place a second chance in the future because I think we didnt order the right stuff. I will skip lunch and come again for dinner to try their more traditional Szechuan dishes.",
    "Go to spot for genera tso chicken that actually is filled with chicken and not just a bunch of fried crust. Would recommend to any of my friends or family.",
    "Amazing food, my only lessor was be careful what you wish for....if you order spicy, its going to be SPICY. I couldn't stop eating it despite the sweat running off my forehead. SO GOOD!",
    "I really wanted to give this place 2 or even 3 stars after the first 5 minutes. It takes a lot for me to slam a restaurant with that low of a rating, but I thought this was going to be one of those times. But there was a LOT of positive that brought my attitude right back up.\nMy first time at Szechuan Opera was to get food to go on a Friday evening. The place was pretty empty when I got there at 5:30pm, so I was a little leery about the decision to try it out.\n First concern.\nI sat at the bar and looked over the menu to decide what I wanted. The staff was pleasant and asked me if I wanted anything to drink while I decided. Very pleasant, I thought... maybe my first impression was wrong. And people are starting to come in for dinner. \nMy wife had texted me her order earlier, and that she wanted Pork Belly Steamed Buns, so I started my order with that. Oh, so sorry, we are out of those, and the Steamed Juicy Buns, too. Ugh! Now I had to call her and find out what she wanted me to order instead. Took me a while to reach her, and I found myself annoyed that the first item she wanted wasn't available. \nOkay, we decided to substitute the Chicken Lettuce Wraps and I added Mung Bean Noodle in Black Bean Sauce. The person taking my order helped me understand the difference between that item and Chengdu Style Mung Bean Nood Noodle. Nice. \nNext I asked for her second item, Spicy Vermicelli with Minced Pork and Bok Choy. Oh, sorry, the server said, that's a typo - there is no Bok Choy in that dish. WTF? I thought. Seriously? A typo in the title of a dish is understandable (one of their items is erroneously named Seafood Rice Doodle Soup), but specifying an ingredient in the dish name that isn't in the dish is NOT a typo. Other dishes included bok choy, so I asked if they could add bok choy to this dish. She went back to ask the chef and came back and said they could. Okay, problem solved, but a problem that should have simply never existed in the first place. Don't call it a typo, just make it as described, for pity's sake.\nSecond concern. I was thinking I should just leave. These people don't have their stuff together, I thought.\nThird, I feel that their prices are high. I get it, the decor is really nice, so this is a good choice for a date or out of town friends. Fine. But $9 for lettuce wraps? I ordered the less expensive Home Style Tofu, and my bill came to almost $50 before tip for 2 starters and 2 entrees. I felt that it was at least $10 over priced.\nOkay, if you read this far, thanks. Now the reason for the 4 stars.\nThe staff was very, very attentive and pleasant. VERY. I was impressed. \nFinally, the food was REALLY excellent. Being Szechuan, it was all quite spicy as anticipated. But the flavors were very well thought out and executed. The ingredients were all very fresh and carefully cut to perfect proportions for the dish. I cannot come up with one single complaint about the food itself, which is why I will be back to dine in for a nice night out sometime soon.",
    "We love this place! Not just good Asian food but just good food in general. Unique Chinese vegetables. Very spicy but lots of flavor.",
    "First, I must admit that the look of the restaurant from the outside doesn't seem like much. However, the interior is like stepping into another world. I never been to China but the look has a feel of an old castle or temple.  Intricate details throughout.  another thing I noticed before even ordering is that most of the clientele were Asian.  To me, this says this place is authentic.  BTW, if you fear spice, you may not want to try true Chinese cuisine.  Szechuan style tends to have a kick to it, so anyone with a palate for complex flavors and heat, you picked the right spot.  Now for the food.  Started with scallion pancakes which where light and crispy.  It would have been awesome with sour cream but I didn't dare to ask.  Also had the crab Rangoon that was piping hot when they arrived so tread carefully.  Stuffed with crab and cream cheese with a light fried dough, it was a good starter to the meal.  For the main course, I ordered the Smoky Pork in Szechuan Style.  Think of thick cuts of bacon sautéed with peppers, onions, and a hot pepper of some kind.  Smokey, salty, and savory is the best words I can think of to describe this dish.  I was so stuffed I had lunch the next day and was just as tasty if not more. The staff was attentive enough so you didn't have to ask yourself where the server is.  Overall, this is a convenient spot right in the heart of Park Ave where you can get authentic Szechuan cuisine.",
    "This restaurant should not exist in Rochester. Rochester does not deserve this restaurant.  Chinese and Rochester usually equates to a deep-fried frozen egg roll, General Tso or Sesame Chicken, and some Lo Mein.  To explain to the average Rochesterian that China is composed of a dozen or so different regions, each with their own distinct cuisines (and variations within each region) would be a waste of time as the conversation would fall on deaf ears.\n\nI must confess that I usually eschew decor and ambience, judging the merit of an establishment on food quality primarily, and service secondarily. To see how the owners transformed a hum-drum pizza hole into a setting that makes you feel you just got off the plane after an 18 hour flight is admirable.  Every square inch seems to have a unique function and purpose.  Nothing seems out of place or unplanned.  I usually feel that these types of settings are contrived and pretentious. Not this time Charlie.\n\nI had the diced chicken with pepper and dried chili in Chongqing style, a dish which I have had at several other restaurant and relished.  Two features of this dish stood out above other versions I have had in the past: the quality of the finish on the tiny bits of fried chicken and the spice level.  I don't know if the chicken pieces were double fried, but they had that super fine crisp without oily texture that can only be achieved from double-frying.  Then there is the spice level.  My nasal cavity got such solid rogering that I detected aromas I haven't known for decades.  More sweat poured off my head than that evening in the sauna in Norway.  I like it rough and abusive, and F-14 on the menu did not disappoint.\n\nI was intimidated by both fellow diners and staff.  Not condescending at all, I just felt out of place, like the town drunk just stumbled into conference of nuclear physicists.  The fellow diners were a mix of caucasian and asian.  The asian diners were so stylish, black clothing, not a hair out of place.  The staff were efficient and tactically stealthy.  The water glass was filled, but I don't remember seeing it being filled.\n\nGo to this restaurant soon, before they move to a City where the quality of decor and cooking is expected and not a fluke.",
    "This is the best restaurant in Rochester. Having had amazing traditional Szechuan food in NYC  (Han Dynasty), this place is even better Han! Traditional and authentic.  Only con is that coming in feels weird because the surrounding stores aren't that nice.ALSO BE AWARE OF THE SPICE LEVEL!",
    "I ordered delivery through Doordash from these folks. I'm so excited that there is another good Szechuan place in Rochester. I order a range to try different things: scallion pancake, dan dan noodles, Diced Chicken in Chongqing Style, ma po tofu, and shredded beef, yung chow fried rice. My favorite was the Ma Po tofu--SO DELICIOUS and SO SPICY. My face was on fire in the best possible way. The shredded beef was good but a bit dry, but that may have been because I ordered as delivery and it wasn't fresh fresh fresh out of the wok--would definitely order in restaurant. The scallion pancake and dan dan noodles were decent but not stand out stellar. Again, this may have been due to the fact that they were delivered, but the scallion pancake was soggy and not very flavorful. The dan dan noodles were flavorful, but warm and mushy. Couldn't tell if they were made and boxed warm of if being in the bag with other warm food made them mushy.\nIn total, it was very good, and looking forward to dining in the restaurant.",
    "Had mapo tofu.  Best mapo I have ever had.  The sauce was the perfect level of spice.  The chef even came out to see if I enjoyed it.  The portion was at least enough to feed 2! I wish this place was near my home.  I was in Portland in a conference for work.  I will be returning my next trip to Portland.",
    "This is probably one of if not the best Chinese restaurant I have ever eaten in.  It is not like going to other Chinese style places.  There are no crispy noodles with 'duck' sauce or mustard. No free tea.  Just the best decor and food available. I saw one complaint about this place that the servers did not speak English that well.  If that bother you go eat at McDonald's.  The place is small and you sit very close to the other diners.   The decor is well thought out without being too much.  The menu is diverse, something for the adventurous and something for those that like simple. I have eaten just about everything there is in Chinese food but when I saw 'dry pot' which is basically a mini wok with a burner underneath I nearly lost it.  You can add spice to make the food hotter.  But any visitor need to remember that this is 'chinese spicy'. It won't melt your lips like hot buffalo wings but it is more subtle.  You eat , go wow this is delish and think oh this isn't spicy.  Then it sneaks up on you and you go wow I think its raining, but in reality it is just the sweat rolling down your forehead.  A good sweat one that makes you go I should stop, but the food is so gloreous that you cant.  When you go remember this is not take out Chinese, not American Chinese, but actual   Chinese food served by people who are well... Chinese.",
    "Pretty good food. We ordered egg rolls and dumplings as appetizers. The egg rolls were pretty good. The fried dumplings weren't the best I had. I ordered lo mein as my main dish and I'd order it again. Overall, pretty good and I'd come back to try a new dish.",
    "First time getting it.Fresh ingredients,ready when told,enough food for 4 meals!!Awesome!!",
    "The food was great! A friend and I split a bottle of wine, app, entree, dessert and tip for less than $40. Food was delicious and the decor was awesome to look at too!",
    "I hate tai food but this person talked me into  Best tài food in the south side..  I had some shit that comes after dinner because it killed my taste bubs I said I'm drinking she said will I'm driveing I said ok and had a saki.  Then she made my night.  Felt good",
    "Amazing atmosphere!  The wine selection is very limited. When ordering be sure to ask what dishes are spicy hot. The menu does not clearly indicate. The food is tasty and an awesome presentation. We will be back again very soon.",
    "Best food I've had in Rochester! Took my parents here last night - I had the dry pot beef, mom had one of the sweeter fish dishes, dad had the cumin-style chicken. Everything was excellent, beautifully cooked and plated, spicy enough for a pepper-head like me while still enjoyable for my parents. Also, the decor and atmosphere were something special! Highly recommended for dinner, date night, or out-of-town guests.",
    "What a shame . This restaurant has good food at fair prices and the owner and his daughter are lovely.\nUnfortunately , you are met by an extremely unpleasant and genuinely rude maitre'd - he is so unpleasant -that we, and another unrelated couple felt so badly treated that we left the restaurant without eating. He made us change tables after we had been seated, wanted to seat us at the same table as another couple. This was a slow time in a half empty restaurant . On a ninety degree day, while I waited for my take out order, he wanted to charge me $1 for a cup of tea. He never says basic \"thank you,\" or smiles.\nPlease get rd of him, or use his services somewhere where he doesn't meet customers. He makes me not want to go to this restaurant .",
    "Wow! This will be our new Park Ave favorite. Stopped in after reading the review in City. The interior is beautiful and comfortable--hard to believe the transformation. The menu has some familiar items, but lots of things I've not had before. We ordered the mung bean noodle appetizer which was deliciously spicy with a great unusual texture. The tofu soupy style was also very good and enough to feed us the rest of the week. My husband had the dry pot style pork which was also fabulous. The flavors in all the dishes were complex and the preparation outstanding. We were there on a Tuesday; it was busy but not packed. Service was friendly and efficient. I can imagine this place will take off. A great addition to the Park Ave neighborhood!",
    "It is a very beautiful place. I was excited to see all this raving reviews about this place so, husband and I decided to give it a try. We ordered the special dry dish, eggplant garlic sauce, and beef tendon chili's sauce. The amount of peppercorn on this dishes is too much. It tasted okay but the more we ate into the beef tendon and the dry special dish, the more numbing aftertaste we felt. We had to stop in the middle of eating since we did not like how it made our mouth feel. I initially asked the waitress what's so special about this dry dish from the other dishes and all she could say is that it's different flavors. Okay? tell me what the different flavors are. If I knew there was peppercorns I wouldn't have wasted my money. \nWill not likely return.",
    "What a great meal. I am reluctant to give five stars because I've only tried about 5 things on the menu, which is a mix of both the new and familiar.  Even the standards, like fried dumplings and cold sesame noodles are done flavorfully and with a unique twist. \nThe service was friendly and helpful. If you remember this space when it was the old Cobbs Hill Pizza, you will not recognize the place. What a transformation. \n\n.",
    "Everything we ate was really good. It was very authentic food. The atmosphere and service were also both very good. We ordered the wontons in chili oil and the mung bean jelly appetizers. We will definitely be ordering both of those again. We also got the pork in cumin, which is also great. The kung pal was OK, but probably the one dish we will not reorder. Everything else was better, so it seems best to stick to the szechuan dishes!",
    "Good Chinese food with a huge menu. Great Schezuan options. A great option for Chinese and one of the best in Rochester. Definitely worth trying.",
    "I swear I'm addicted to the Ma Po Tofu. It's sooo good and so spicy and they give you enough for 2 meals! I don't even like tofu much usually but this one is a 10 out of 10. Also have had the soupy style tofu and that's a 10 as well. I've been getting takeout here weekly since I first tried it. Also, they have online ordering which is so convenient!",
    "Banging awesome food. Love it. Best Szechuan around. We're 2 hours away and every time we are in town we get food here and it never disappoints.",
    "I was underwhelmed by Szechuan Opera. The cold sesame noodles I ordered tasted (and had the texture) like they were coated in sugar. My tofu in garlic style sauce was bland and not at all garlicky. I found the staff to be pretty rude, too. I will not be back.",
    "Wanted to have lunch here but when I walked in at 11:50 no customers were in the restaurant waited by the front to be seated no one greeted me. There was a woman sitting in the back with her feet up eating something and I could see someone in the kitchen. I waited several minutes and finally said \" I guess I'll come back when your open\" I did not get a response so I walked out. Double checked there hours it said they were open. I was very disappointed when you won't even greet a customer or respond to them .",
    "The food at Szechuan Opera is really, really good, and I say this as someone who grew up in Asia. I've ordered from them 3 times, and had about 10 different items on the menu, all of which were great. The chicken and broccoli sauce was delicious and unlike any I've had in other chinese restaurants, where it sometimes seems like there is a \"one-sauce fits all\" cooking style. I was also ordering for vegetarian companions, and the string beans were fantastic, as was the eggplant in garlic sauce. They used plump Chinese/Japanese style thin eggplants in this dish--absolutely delicious. It's been all take-out so far for me, but I plan to eat at the restaurant soon, to try even more.",
    "A nice place for some decent Chinese food. This is a must go place. Everything is good on the menu",
    "I used to like their food. None of the food I bought recently tastes as good as before. Maybe it's a different chef.",
    "Best Chinese food I've ever had! I ordered some takeout the other night and got the Sesame Chicken. It was so delicious I will definitely be back!",
    "This restaurant has the best Szechuan Chinese food is this area . Serve a variety of different dishes, grand opening now. I hi recommend coming here to dine in",
    "The waitress didn't seem to speak much english and was straight to the point, \"order now?, that's it?\" My girlfriend is a vegetarian and ordered dry pot vegetable which to our surprise was actually cabbage and pork. The waitress thankfully let us exchange it for something vegetarian and agreed it was misleading. I ordered the chongqing chicken which had a nice presentation but was more dried chili peppers than chicken. Despite the mostly inedible dish, the chicken did have a lot of flavor.",
    "Authentic, fresh and out of this country meals.  Best Asian cuisine found in Rochester. The lamb dry pot was absolutely incredible and I can tell you the dumplings were the best we've had. They were light and flavorful. The only downside was having to stop eating.  Check them out, you won't be disappointed!",
    "We ordered potstickers and two of the sizzling dishes. Potstickers good, sizzling pots very sweet and not as many veggies as expected. Still, thanks for cooking!",
    "Lovely atmosphere and the food options are not only varied but what I had was exceptional! Can't wait to try more things there. The staff was super nice as well.",
    "It's a beautiful restaurant! The decor is chic and lovely.\nThe service was exceptional. The menu was very self-explanatory which was helpful. Food was plentiful, as we took a large doggy bag home. This is true Szechuan food at it's finest. A great experience in Rochester. Finally authentic Szechuan food!  We'll be back for more.",
    "This is an excellent new restaurant. They have only been open a few weeks, but word is getting out about them and it totally should. The atmosphere is beautiful. The tables are comfortable and the staff accommodating. We dined from 5pm to 7pm on a Thursday night. We were the first people there and when we left it was a packed house. Was disappointed that they didn't have pork belly buns, but since we are absolutely going back, we will try them next time. We had two different seafood dishes and they were incredibly fresh. The spices are great, not overpowering the flavor of the dishes. The only basic thing we tried was the crab Rangoon and it was delicious. Honestly can't wait to go back and am totally telling my friends to give them a try.",
    "The food tastes so flavorful and it is definitely spicy, I am going back again for a second time to try something new. Would highly reccomend",
    "Best Szechuan place in the city!\nThe restaurant is beautiful on the inside, and the food is bomb!\nSome favorites of mine are the Ma Po Tofu and Chongqing style chicken.",
    "Very tasty! The spicy is very authentic sichuan flavor! The take out package is also very neat.",
    "Really looking forward to Something Different, however was disappointed with the texture and condition of the chicken in my supey chicken dish.  The spices were great, although the oil in this dish sat on the top sides of the bowl.  The chicken was slippery and thin in texture, which lead me to believe that the chicken was frozen process chicken and not 100% real chicken.  Which is VERY disappointing to say the least.  I have experiences this kind of bait and switch at a very well known Chinese restaurant on Monroe Avenue in Rochester.  \n\nThe atmosphere was great, it made me feel like I was in China.  Spices good and they are certainly trying.  But \"buyer be beware\" the meat, at least the chicken is PROCESSED chicken product.",
    "One of the best restaurants in town. Location isn't the best as it makes it seem like it won't be good, but don't judge by the location this place is delicious! Menu is great lots of options to choose from and the food is amazing. It's also nice to park in the parking lot instead of trying to find street parking on Park Ave that's a major bonus. Friendly staff, clean place. This will become a regular spot for us.",
    "The only restaurant I have ordered from with a restaurant delivery service that did not disappoint. The food was delivered hot, fresh and delicious. I will be ordering regularly from here, probably the Dan Dan noodles every time till I get tired of them. So good.",
    "The chongching style chicken is to die for. Seriously, if you even remotely like spicy food, get it. The flavors are second to none.",
    "Authentic Sichuan cuisine. After staying in China for nearly a decade, we were hooked to the wholesome flavorsome Sichuan (Szechuan) cuisine.... We are beyond delighted and ecstatic to discover this gem of a restaurant in our neighborhood in ROC!!",
    "18 bucks a serving?!? For takeaway!?!...grl plz. It's just alright, for 10 bucks it would get a good review. ‍",
    "Szechuan Garden has become one of my favorite go-to restaurants in Rochester. The decor is quite intricate and amazing despite what the outside may look like. It's not usually so crowded but you are unlikely to be eating alone. Its Szechuan food so expect some spice and the occasional tingling peppercorn taste. I always get the Dan Dan Noodles and highly recommend it. Its listed as a cold dish and usually is elsewhere but it has always been served warm here and I don't mind that at all. I also really love the dry pot style dishes in chicken or pork and the cumin lamb. All of these are amazing. The garlic sauce dishes were actually a bit too sweet for my taste though. The one time I tried ordering a typical chinese dish - Kung Pao Chicken - I felt it tasted the same as the garlic sauce dish - a little too sweet. I concluded that this is not the place to get your typical Chinese dishes, especially not in place of the Szechusn dishes which are amazing. Perhaps because I've gotten used to it but I felt the spice level on my last 2 visits was very tolerable. Pro Tip: If you find the food too spicy - def try the coconut drink!",
    "Cold food. Some good flavors. Toughest beef on the planet. Yelp wants more words to post this. Don't eat here.",
    "I ordered food through Grubhub and was amazed with the food, I'm so happy I found this place because I live nearby.",
    "Checked this place out on a Saturday night after scouring the reviews for local Szechuan. We got there around 5:45 pm and managed to beat the crowd. It was packed by the time we left around 6:30. Overall good service, immersive Chinese decor, and tasty food, but would strongly recommend taking a Prilosec beforehand if you want to avoid heartburn!",
    "Lovely restaurant in the Park Ave neighborhood. I'll admit that I stick to ordering the traditional Chinese favorites, as Szechuan dishes are too spicy for me. Good food, friendly staff, lovely decor.",
    "Tried it out for take out. Was really happy with the experience and the food. I hope this little space makes it... looking forward to dining in next!",
    "Love it here! Not only is the food great and the staff friendly, the the ambiance is gorgeous! I had dinner with five friends in one of their booths and it felt like we had a private table. And each booth had a phone charger! Very beautiful space.",
    "Excellent. We had a great meal last night at Szechuan Opera. Our favorites were the Mei Fun, chicken lettuce wraps, General Tsos. Very affordable, as well. Will definitely be back!",
    "At last!  Authentic Chinese food!  We lived in Sichuan Province (Nanchong city) for 2 years, and were delighted to experience some of our old spicy favorites.  Hui Guo Ruo (Twice Cooked Pork) was our favorite, I think, but we also especially enjoyed the \"Ants Climbing the Hill\" (Ma Yi Shang Shu) - described in menu as \"Vermacelli with pork and bok choi\" (although there's no bok choi and isn't supposed to be in this traditional sichuan dish), Gan Bian Si Ji Dou (Dry Fried Green Beans), Ma Po Do Fu (Spicy Lady Tofu), and the Suan Cai Feng Si Tang (Sour Vegetable, pork, noodle soup).  The only thing a bit disappointing was the Guo Bao Rou (described in menu as \"sizzling\" pork -- this dish is supposed to be very hot pork & veggies poured over rice cakes at the table -- and it all sizzles), but it was all brought out on one plate -- no sizzling, and the tomato sauce was uninspired and a bit too sweet.  However, Guo Bao Rou is more of a northern dish than Sichuan, so we will forgive, as the specialty is Sichuan.    Delightfully decorated and pleasant staff -- this has already become a family favorite!",
    "I am thrilled when a restuarant like this opens.  I ordered the Beef and Tripe in Chili Sauce and Beef Tendon in Chili Sauce appetizers.  These dishes were outstanding.  They nailed it.  The texture, spicyness, aroma, were all perfect.  That's not an easy accomplishment.  I also ordered the Stewed Pork Shoulder.  It came in a rich broth with Floral Shiitake mushrooms, bok choy, bamboo shoots, and garlic.  The succulent skin-on bone-in pork shoulder was perfectly tender with loads of flavor.  I love to find items like these that take too long to cook myself at home and find them done so well at a restaurant.  I ordered takeout and the order was ready on time, and there was no wait.  When I arrived, I was really impressed with the decor.  They must have spent a long time preparing the space, and I can't wait to visit again, and again.",
    "The BEST decor for Chinese restaurant!! Feel like you are in China !  A++ for decor. Sorry the food was ok'd! I don't know if the restaurant wasn't ready for business or the waitress was new!! I had to wait like over an hour for my meal, my friends meal was cold and came out first.  I felt bad for the waitress, other waitress felt bad for me she brought a dish of cold Chinese veggies at no charge.  Over all, food was ok and it is sorta pricey, I guessed anything or businesses on park Ave is expensive.",
    "Just ate at Szechuan Opera for the first time! The ambiance is perfect! Open, comfortable and really well designed interior. The food was delicious. Our server, Raymond was gracious and attentive- made for a lovely dining experience. Dan dann noodles are an awesome starter. We will definitely be back!",
    "This is an amazing place. Great food. You have to try their Dry Pots. Delicious.  A great addition to our neighborhood.",
    "Incredible atmosphere and reasonably priced authentic Sichuan cuisine. Straight up reminds me of home and I couldn't be happier"
  ],
  "analysis": {
    "sentiment_distribution": {
      "Positive": 153,
      "Neutral": 21,
      "Negative": 35
    },
    "average_confidence": 0.9014048543558166,
    "predictions": [
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Neutral",
      "Positive",
      "Negative",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Neutral",
      "Positive",
      "Negative",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Neutral",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Neutral",
      "Negative",
      "Positive",
      "Negative",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Neutral",
      "Neutral",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Neutral",
      "Positive",
      "Negative",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Negative",
      "Negative",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Negative",
      "Positive",
      "Neutral",
      "Positive",
      "Negative",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Positive",
      "Neutral",
      "Positive",
      "Positive",
      "Positive"
    ],
    "confidence_scores": [
      0.9918448328971863,
      0.7035669684410095,
      0.9731975793838501,
      0.49894022941589355,
      0.9942561984062195,
      0.9869131445884705,
      0.6777665019035339,
      0.9956797361373901,
      0.9105053544044495,
      0.991176962852478,
      0.8230295181274414,
      0.9903941750526428,
      0.9894213676452637,
      0.9943619966506958,
      0.9547435641288757,
      0.8261952996253967,
      0.9969700574874878,
      0.9537174701690674,
      0.9195047616958618,
      0.9904324412345886,
      0.9917238354682922,
      0.9968736171722412,
      0.9937111139297485,
      0.9966804385185242,
      0.9962629675865173,
      0.9926884174346924,
      0.9960734844207764,
      0.5492620468139648,
      0.9902359843254089,
      0.9694550037384033,
      0.44437408447265625,
      0.8670907616615295,
      0.9930497407913208,
      0.9058161973953247,
      0.5362693071365356,
      0.9382791519165039,
      0.641327440738678,
      0.5562222003936768,
      0.9972541928291321,
      0.6347190737724304,
      0.7269101142883301,
      0.9965904951095581,
      0.9845952987670898,
      0.9925038814544678,
      0.9943154454231262,
      0.9917173981666565,
      0.9928418397903442,
      0.6629408597946167,
      0.9414145350456238,
      0.9944701194763184,
      0.6426803469657898,
      0.907343864440918,
      0.9829925894737244,
      0.93220055103302,
      0.9412223100662231,
      0.9858285188674927,
      0.9774431586265564,
      0.9512114524841309,
      0.9914484024047852,
      0.9925321936607361,
      0.982153594493866,
      0.9748657941818237,
      0.9952768087387085,
      0.8114343881607056,
      0.9332404136657715,
      0.9968937635421753,
      0.9972004890441895,
      0.9451019763946533,
      0.993335485458374,
      0.36524662375450134,
      0.997312068939209,
      0.997313916683197,
      0.6052688360214233,
      0.7415351867675781,
      0.6942172050476074,
      0.9944751858711243,
      0.9831389784812927,
      0.8129227161407471,
      0.9962659478187561,
      0.9952001571655273,
      0.9763618111610413,
      0.9945628046989441,
      0.5500096678733826,
      0.9964181184768677,
      0.9405727386474609,
      0.9887205958366394,
      0.9951778650283813,
      0.9845631718635559,
      0.9672096371650696,
      0.7669550776481628,
      0.9967374205589294,
      0.9908479452133179,
      0.8345411419868469,
      0.9930672645568848,
      0.9966532588005066,
      0.8702090978622437,
      0.5988563299179077,
      0.9847534894943237,
      0.6454208493232727,
      0.987069845199585,
      0.9942837357521057,
      0.9965153932571411,
      0.99491947889328,
      0.9970054030418396,
      0.9754837155342102,
      0.9946395754814148,
      0.9917889833450317,
      0.9814972877502441,
      0.5084576606750488,
      0.9971143007278442,
      0.9963141083717346,
      0.9894071221351624,
      0.9946190118789673,
      0.8875429630279541,
      0.9927800297737122,
      0.5782108902931213,
      0.9941754937171936,
      0.9844167828559875,
      0.5015931129455566,
      0.8185514211654663,
      0.6993917226791382,
      0.9964759945869446,
      0.5816127061843872,
      0.9839491248130798,
      0.9827577471733093,
      0.9958290457725525,
      0.9970147609710693,
      0.9966865181922913,
      0.9812109470367432,
      0.7642810344696045,
      0.9972687363624573,
      0.9971128702163696,
      0.9922646284103394,
      0.44401976466178894,
      0.9970947504043579,
      0.9972232580184937,
      0.9931814074516296,
      0.9945840239524841,
      0.9920815229415894,
      0.9652616381645203,
      0.6172727942466736,
      0.992026150226593,
      0.9957631826400757,
      0.9320040941238403,
      0.9921431541442871,
      0.9970383644104004,
      0.997363269329071,
      0.9403696656227112,
      0.5619058012962341,
      0.8613670468330383,
      0.9962354302406311,
      0.6237289309501648,
      0.994316041469574,
      0.9698390364646912,
      0.980778694152832,
      0.9956731200218201,
      0.48194625973701477,
      0.9772751927375793,
      0.9498780965805054,
      0.8922185897827148,
      0.9817138910293579,
      0.978289008140564,
      0.4350743293762207,
      0.9957054257392883,
      0.9972869157791138,
      0.9661504626274109,
      0.9953816533088684,
      0.5002996921539307,
      0.9867950081825256,
      0.9318035244941711,
      0.9951035976409912,
      0.9710595607757568,
      0.9965531826019287,
      0.9518787860870361,
      0.9725773334503174,
      0.9910518527030945,
      0.9688720107078552,
      0.6890708804130554,
      0.9970821738243103,
      0.9907912015914917,
      0.59763503074646,
      0.996557891368866,
      0.5665436387062073,
      0.9879047870635986,
      0.9964961409568787,
      0.995527446269989,
      0.7001636624336243,
      0.9961810111999512,
      0.9925514459609985,
      0.528683602809906,
      0.9941784143447876,
      0.996353268623352,
      0.9651530981063843,
      0.9973141551017761,
      0.6470010280609131,
      0.9909979104995728,
      0.6802272796630859,
      0.9914814233779907,
      0.9385138154029846,
      0.9932060241699219,
      0.9124050140380859,
      0.9967544674873352,
      0.9956753849983215,
      0.9963177442550659,
      0.9935318231582642,
      0.7950819134712219,
      0.9959259033203125,
      0.9967674016952515,
      0.993883490562439
    ]
  }
}